In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
dict1 = {
    "name":["Rehan","sid","orton","john"],
    "marks" : [98,87,76,66],
    "city": ["Koregaon","Satara","pune","mumbai"]
}

In [4]:
dict

dict

In [5]:
dict1

{'name': ['Rehan', 'sid', 'orton', 'john'],
 'marks': [98, 87, 76, 66],
 'city': ['Koregaon', 'Satara', 'pune', 'mumbai']}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

    name  marks      city
0  Rehan     98  Koregaon
1    sid     87    Satara
2  orton     76      pune
3   john     66    mumbai

In [8]:
df.to_csv("friends.csv", index = False)

In [9]:
df

    name  marks      city
0  Rehan     98  Koregaon
1    sid     87    Satara
2  orton     76      pune
3   john     66    mumbai

In [10]:
df.head(2)

    name  marks      city
0  Rehan     98  Koregaon
1    sid     87    Satara

In [11]:
df.tail(2)

    name  marks    city
2  orton     76    pune
3   john     66  mumbai

In [12]:
df.describe()

          marks
count   4.00000
mean   81.75000
std    13.81726
min    66.00000
25%    73.50000
50%    81.50000
75%    89.75000
max    98.00000

In [13]:
rs = pd.read_csv("train.csv")

rs

In [14]:
rs

       train  speed      city
0      koyna     98  Koregaon
1    nizamud     87    Satara
2   ortonuou     76      pune
3  viv espre     66    mumbai

In [15]:
rs["city"]

0    Koregaon
1      Satara
2        pune
3      mumbai
Name: city, dtype: object

In [16]:
rs["speed"][0]

98

In [17]:
rs.index = ["i","ii","iii","iv"]

In [18]:
rs

         train  speed      city
i        koyna     98  Koregaon
ii     nizamud     87    Satara
iii   ortonuou     76      pune
iv   viv espre     66    mumbai

In [22]:
ser = pd.Series(np.random.rand(34))

In [23]:
ser

0     0.755299
1     0.509112
2     0.582253
3     0.635717
4     0.850748
5     0.693554
6     0.130759
7     0.615778
8     0.927989
9     0.922886
10    0.819147
11    0.668070
12    0.103048
13    0.069458
14    0.554987
15    0.803281
16    0.810706
17    0.524350
18    0.808441
19    0.569160
20    0.835150
21    0.750947
22    0.666455
23    0.487763
24    0.240409
25    0.118729
26    0.977091
27    0.824586
28    0.556981
29    0.378729
30    0.095362
31    0.293626
32    0.648679
33    0.828808
dtype: float64

In [21]:
ser

0    <built-in method rand of numpy.random.mtrand.R...
dtype: object

In [27]:
newpf = pd.DataFrame(np.random.rand(400,5))

In [28]:
newpf

            0         1         2         3         4
0    0.725972  0.157117  0.131848  0.511996  0.470288
1    0.674660  0.037339  0.842238  0.620487  0.118883
2    0.751566  0.646365  0.825500  0.662759  0.239445
3    0.687634  0.261216  0.401092  0.285415  0.807674
4    0.715264  0.669283  0.187414  0.598611  0.260481
..        ...       ...       ...       ...       ...
395  0.929343  0.448676  0.816052  0.692572  0.469546
396  0.747106  0.817797  0.564238  0.796849  0.591886
397  0.138093  0.486668  0.857716  0.420301  0.654909
398  0.564237  0.062270  0.075320  0.464854  0.042519
399  0.509645  0.998513  0.218940  0.186561  0.588978

[400 rows x 5 columns]

In [32]:
newpf.head(10)

          0         1         2         3         4
0  0.725972  0.157117  0.131848  0.511996  0.470288
1  0.674660  0.037339  0.842238  0.620487  0.118883
2  0.751566  0.646365  0.825500  0.662759  0.239445
3  0.687634  0.261216  0.401092  0.285415  0.807674
4  0.715264  0.669283  0.187414  0.598611  0.260481
5  0.329748  0.552117  0.184096  0.047615  0.995370
6  0.599247  0.672627  0.456013  0.780886  0.470963
7  0.654802  0.260737  0.452202  0.241756  0.564831
8  0.073396  0.129069  0.881702  0.290000  0.534090
9  0.059456  0.157490  0.399199  0.926560  0.800581

In [34]:
newpf.describe()

                0           1           2           3           4
count  400.000000  400.000000  400.000000  400.000000  400.000000
mean     0.508703    0.492905    0.514913    0.510037    0.493478
std      0.289798    0.286737    0.284623    0.288135    0.289608
min      0.000469    0.004161    0.001021    0.002390    0.003750
25%      0.258232    0.249447    0.267804    0.263048    0.246880
50%      0.522836    0.488263    0.530144    0.509967    0.498789
75%      0.756369    0.716362    0.751277    0.766962    0.743238
max      0.997627    0.998513    0.994741    0.994228    0.998144

In [37]:
newpf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [38]:
newpf[0][0] = "Rehan"

In [39]:
newpf

            0         1         2         3         4
0       Rehan  0.157117  0.131848  0.511996  0.470288
1     0.67466  0.037339  0.842238  0.620487  0.118883
2    0.751566  0.646365  0.825500  0.662759  0.239445
3    0.687634  0.261216  0.401092  0.285415  0.807674
4    0.715264  0.669283  0.187414  0.598611  0.260481
..        ...       ...       ...       ...       ...
395  0.929343  0.448676  0.816052  0.692572  0.469546
396  0.747106  0.817797  0.564238  0.796849  0.591886
397  0.138093  0.486668  0.857716  0.420301  0.654909
398  0.564237  0.062270  0.075320  0.464854  0.042519
399  0.509645  0.998513  0.218940  0.186561  0.588978

[400 rows x 5 columns]